jonathan-shc/UWB/ports/esp32/apps/reader/sdkconfig.defaults.esp32c5
# ESP32-C5 target (applied by idf.py after sdkconfig.defaults; later wins).
# 4 MB is the safe floor across ESP32-C5-WROOM-1 flash variants, so the 16 MB
# S3 partition layout shrinks to partitions_4mb.csv (factory 0x3E0000).
CONFIG_IDF_TARGET="esp32c5"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_4mb.csv"
